<?php // Script on PAGE
include("../main_include.php");
		
$trnIOT = json_decode(file_get_contents('php://input'));
//{"id":33,"slot_id":0,"coin1B":0,"coin2B":0,"coin5B":0,"coin10B":0,"note20B":0,"coinCashOut":0,"coinCashTube":292,"refill":0,"date_time":"2018-08-01 16:05:00","server_sendflag":0,"kioskid":1}

	$err = NULL; //ประกาศตัวแปร เพื่อเก็บ Error โดยการต่อ Strings ไปเรื่อย
	#Case 	#1 บอร์ดรายงานตัว ทุก 5 นาที ว่ายังมี ชีวิตอยู่ 
				#1.1 มีชีวิตอยู่  //ไม่ต้องส่งค่าอะไรมา	 
				#1.2 บอร์ดไม่มีการส่งค่ามา แต่ Remote ได้ 		//เป็นไปได้ว่า สายข้อมูล มีปัญหา
				#1.2 บอร์ดไม่มีการส่งค่ามา + Remote ไม่ได้  	//เป็นไปได้ว่า บอร์ดค้าง หรือ GSM มีปัญหาต่อการส่ง
	#Case	#2 บอร์ดตรวจสอบว่า รับค่า สล็อต เหรียญ แบงค์ มาได้ ครบปกติไหม
				#2.1 ไม่มีค่า สล็อต
				$err .= 'S';
				#2.2 ไม่มีค่า เหรียญ //แยกประเภท
				$err .= 'C'; //เติมตัวเลขเข้าไปท้าย C เช่น C1 C2 C5 C10
				#2.3 ไม่มีค่า แบงค์
				$err .= 'N';
	#Case	#3 บอร์ดตรวจสอบว่า รับข้อมูลมาแล้ว สามารถเก็บลง hdd เพื่อรอส่งออก ได้ไหม
				#3.1 ไม่สามารถเก็บลง hdd ได้
				$err .= 'H';

	